{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "cf200b48",
   "metadata": {},
   "source": [
    "# Простые алгоритмы python"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6034042b",
   "metadata": {},
   "source": [
    "Решение любых задач подразумевает либо неиспользование встроенных функций, либо их минимальное количество. Поскольку любая алгоритмическая задача - это задача на развитие алгоритмического интеллекта. Реализация многих алгоритмов будет не самой лучшей, и изменение качества кода будет заметно с количество решенных задач."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1c1369e1",
   "metadata": {},
   "source": [
    "## Задача 1: Средний элемент\n",
    "\n",
    "Рассмотрим три числа a, b и c. Упорядочим их по возрастанию.\n",
    "\n",
    "Какое число будет стоять между двумя другими?\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "В единственной строке записаны три целых числа a, b и c (−1000≤a,b,c≤1000), числа разделены одиночными пробелами.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Выведите число, которое будет стоять между двумя другими после упорядочивания.\n",
    "\n",
    "**Задача с CodeRun:** https://coderun.yandex.ru/problem/median-out-of-three?compiler=python"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3c2f7a77",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Для набора данных (0, 480, -363) среднее значение равно 0\n",
      "Для набора данных (-1000, -541, 154) среднее значение равно -541\n",
      "Для набора данных (846, 638, -668) среднее значение равно 638\n",
      "Для набора данных (-400, 256, -204) среднее значение равно -204\n",
      "Для набора данных (482, 531, 21) среднее значение равно 482\n",
      "Для набора данных (-451, 942, -725) среднее значение равно -451\n",
      "Для набора данных (-334, 28, -549) среднее значение равно -334\n",
      "Для набора данных (-448, -845, -201) среднее значение равно -448\n",
      "Для набора данных (-855, -862, 774) среднее значение равно -855\n",
      "Для набора данных (94, 536, -985) среднее значение равно 94\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "from random import randint\n",
    "\n",
    "def middle_value(a, b, c): # Корявая реализация сортировки пузырьком с нахождением среднего значения\n",
    "    data = [a, b, c]\n",
    "    \n",
    "    i = 0\n",
    "    count = 0\n",
    "    while count < 100:\n",
    "        if i == 2:\n",
    "            i = 0\n",
    "        \n",
    "        if data[i] > data[i + 1]:\n",
    "            data[i], data[i + 1] = data[i + 1], data[i]\n",
    "        \n",
    "        count += 1\n",
    "        i+=1\n",
    "    return data[1]\n",
    "\n",
    "\n",
    "args = [(randint(-1000, 1000), randint(-1000, 1000), randint(-1000, 1000)) for i in range(10)] # Генерируем тестовый набор данных\n",
    "\n",
    "for i in range(10):\n",
    "    print(f\"Для набора данных {args[i]} среднее значение равно {middle_value(args[i][0], args[i][1], args[i][2])}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d59d3b8",
   "metadata": {},
   "source": [
    "## Задача 2: \n",
    "\n",
    "У одного из студентов в комнате живёт кузнечик, который очень любит прыгать по клетчатой одномерной доске. Длина доски — N клеток. К его сожалению, он умеет прыгать только на 1, 2, ..., k клеток вперёд.\n",
    "\n",
    "Однажды студентам стало интересно, сколькими способами кузнечик может допрыгать из первой клетки до последней. Помогите им ответить на этот вопрос.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "В первой и единственной строке входного файла записано два целых числа — N и k (1⩽N⩽30, 1⩽k⩽10).\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Выведите одно число — количество способов, которыми кузнечик может допрыгать из первой клетки до последней.\n",
    "\n",
    "**Задача с CodeRun:** https://coderun.yandex.ru/problem/grasshopper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7e2d3852",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "e89dbf9b",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
